tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
            switch (current_run_mode) {
                case    run_mode_follow_zx:
                case    run_mode_follow_x: {
                            stepper_target_pos_x = libdivide::libdivide_s64_do(absolute_actual_pos * int64_t(stepper_follow_mul_x), &stepper_follow_div_x_opt);
                            stepper_target_pos_x += stepper_off_x;
                        } break;
                case    run_mode_jog_x: {
                			jog_calc_step_delay_time();
                			if (jog_state.run_state != STOP) {
                				if (jog_state.dir > 0) {
	                				stepper_target_pos_x++;
	                			}
                				if (jog_state.dir < 0) {
	                				stepper_target_pos_x--;
	                			}
                			}
                        } break;
                case    run_mode_cycle_pause:
                case    run_mode_cycle: {
                            int32_t mul_x = current_cycle[current_cycle_idx].stepper_mul_x;
                            const libdivide::libdivide_s64_t &div_x_opt = current_cycle[current_cycle_idx].stepper_div_x_opt;
                            stepper_target_pos_x = libdivide::libdivide_s64_do(absolute_actual_pos * int64_t(mul_x), &div_x_opt);
                            stepper_target_pos_x += stepper_off_x;
                        } break;
                default: {
                        } break;
            }

            int32_t sxdelta = int32_t(stepper_target_pos_x - stepper_actual_pos_x);

            if (abs(sxdelta) >= 2880) {
                error_state_out_of_sync = sxdelta;
            }

            if (sxdelta == 0) {
                // nop
            } else if (sxdelta < 0) {
                if (stepper_dir_x != -1) {
                    stepper_dir_x = -1;
                    GPIOB->BSRR = GPIO_BSRR_BR5;
                    // wait until next cycle to do the pulse
                } else {
                    stepper_actual_pos_x--;
                    GPIOB->BSRR = GPIO_BSRR_BS11;
                    flip_x ^= 1;
                }
            } else if (sxdelta > 0) {
                if (stepper_dir_x != +1) {
                    stepper_dir_x = +1;
                    GPIOB->BSRR = GPIO_BSRR_BS5;
                    // wait until next cycle to do the pulse
                } else {
                    // now do the actual pulse
                    stepper_actual_pos_x++;
                    GPIOB->BSRR = GPIO_BSRR_BS11;
                    flip_x ^= 1;
                }
            }
        } else {
			if (current_run_mode == run_mode_jog_z ||
				current_run_mode == run_mode_jog_x) {
				TIM2->ARR = jog_state.step_delay;
			}
            GPIOB->BSRR = GPIO_BSRR_BR11;
            flip_x ^= 1;
        }

        if (current_run_mode == run_mode_cycle ||
            current_run_mode == run_mode_cycle_pause) {
            bool do_next_cycle_step = false;
            if (current_cycle[current_cycle_idx].target_axs == 0) {
                if (stepper_actual_pos_z == (int64_t(current_cycle[current_cycle_idx].target_pos) + stepper_off_z)) {
                    stepper_off_z = stepper_actual_pos_z;
                    do_next_cycle_step = true;
                }
            }
            if (current_cycle[current_cycle_idx].target_axs == 1) {
                if (stepper_actual_pos_x == (int64_t(current_cycle[current_cycle_idx].target_pos) + stepper_off_x)) {
                    stepper_off_x = stepper_actual_pos_x;
                    do_next_cycle_step = true;
                }
            }
            if (do_next_cycle_step) {
                __disable_irq();
                absolute_pos = 0;
                absolute_pos_start_offset = cnt;
                current_cycle_idx++;
                if (current_cycle_idx == current_cycle_len) {
                    current_run_mode = run_mode_none;
                }
                if (current_cycle[current_cycle_idx].wait_for_index_zero) {
                    wait_for_index_zero = 1;
                    index_zero_occured = 0;
                }
                __enable_irq();
            }
        }

        cycle_counter = *DWT_CYCCNT;
    }
}

void TIM3_IRQHandler(void)
{
    if ((TIM3->SR & TIM_SR_UIF)) {
        TIM3->SR &= ~(TIM_SR_UIF);
    }
}

#ifdef __cplusplus
} // extern "C" {
#endif  // #ifdef __cplusplus

static void set_zero_pos()
{
    // Protect against TIM3 IRQ race
    __disable_irq();
    absolute_pos = 0;
    absolute_pos_start_offset = 0;
    stepper_actual_pos_z = 0;
    stepper_actual_pos_x = 0;
    stepper_off_z = 0;
    stepper_off_x = 0;
    wait_for_index_zero = 1;
    index_zero_occured = 0;
    __enable_irq();
}

static void maybe_enable_steppers()
{
    if (current_run_mode == run_mode_idle) {
        // Z axis
        GPIOB->BSRR = GPIO_BSRR_BS12; // set to high disables driver
        // X axis
        GPIOB->BSRR = GPIO_BSRR_BS15; // set to high disables driver
        return;
    }
    if (current_run_mode == run_mode_none) {
        switch (previous_run_mode) {
            case    run_mode_follow_z: {
                        // X axis
                        GPIOB->BSRR = GPIO_BSRR_BS15; // set to high disables driver
                    } break;
            case    run_mode_follow_x: {
                        // Z axis
                        GPIOB->BSRR = GPIO_BSRR_BS12; // set to high disables driver
                    } break;
            case    run_mode_follow_zx: {
                        // NOP
                    } break;
            default: {
                        // Z axis
                        GPIOB->BSRR = GPIO_BSRR_BS12; // set to high disables driver
                        // X axis
                        GPIOB->BSRR = GPIO_BSRR_BS15; // set to high disables driver
                    } break;
        }
        return;
    }

    switch (current_run_mode) {
        case    run_mode_follow_z: {
                    // X axis
                    GPIOB->BSRR = GPIO_BSRR_BS15; // set to high disables driver
                    // Z axis
                    GPIOB->BSRR = GPIO_BSRR_BR12; // set to low enables driver
                } break;
        case    run_mode_follow_x: {
                    // Z axis
                    GPIOB->BSRR = GPIO_BSRR_BS12; // set to high disables driver
                    // X axis
                    GPIOB->BSRR = GPIO_BSRR_BR15; // set to low enables driver
                } break;
        default: {
                    // X axis
                    GPIOB->BSRR = GPIO_BSRR_BR15; // set to low enables driver
                    // Z axis
                    GPIOB->BSRR = GPIO_BSRR_BR12; // set to low enables driver
                } break;
    }
}

