tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
static void set_current_run_mode(run_mode mode)
{
    if (mode != current_run_mode) {
        __disable_irq();
        int16_t cnt = TIM3->CNT;

        stepper_off_z = stepper_actual_pos_z;
        stepper_off_x = stepper_actual_pos_x;

        absolute_pos = 0;
        absolute_pos_start_offset = cnt;

        current_run_mode = mode;
        __enable_irq();
    }
    switch (current_run_mode) {
        case    run_mode_follow_z:
        case    run_mode_follow_x: {
                    TIM2->ARR = 500;
                } break;
        default: {
                    // slow down as we now have two long divides potentially
                    TIM2->ARR = 1000;
                } break;
    }
    maybe_enable_steppers();
}

static void set_follow_values(int32_t axis, int32_t mul, int32_t div)
{
    if (div == 0) {
        return;
    }

    __disable_irq();

    int16_t cnt = TIM3->CNT;

    if (axis == 0) {
        stepper_follow_mul_z = mul;
        stepper_follow_div_z = (mul != 0) ? div : 1;
        stepper_follow_div_z_opt = libdivide::libdivide_s64_gen(stepper_follow_div_z);

        stepper_off_z = stepper_actual_pos_z;

        absolute_pos = 0;
        absolute_pos_start_offset = cnt;
    }

    if (axis == 1) {
        stepper_follow_mul_x = mul;
        stepper_follow_div_x =(mul != 0) ? div : 1;
        stepper_follow_div_x_opt = libdivide::libdivide_s64_gen(stepper_follow_div_x);

        stepper_off_x = stepper_actual_pos_x;

        absolute_pos = 0;
        absolute_pos_start_offset = cnt;
    }
                        
    __enable_irq();
}

static void send_bad_crc_response()
{
    const char *response = "BADCRC83AA\n";
    for (size_t c=0; c<7; c++) {
        put_char(response[c]);
    }
}

static void send_invalid_response()
{
    const char *response = "INVALID6E66\n";
    for (size_t c=0; c<7; c++) {
        put_char(response[c]);
    }
}

static void send_ok_response()
{
    const char *response = "OKB775\n";
    for (size_t c=0; c<7; c++) {
        put_char(response[c]);
    }
}

static void parse(void) {
    uint8_t in_char;
    static char buf[256];
    static size_t buf_pos = 0;
    while(get_char(&in_char)) {
        if(in_char != '\n') {
            buf[buf_pos++] = in_char;
            if (buf_pos > 32) {
                buf_pos = 0;
                break;
            }
        } else {
            if (buf_pos<4) {
                send_bad_crc_response();
                buf_pos = 0;
                break;
            }

            const size_t size_of_crc = 4;

            // Check CRC16 for every command
            uint16_t crc = CRC16(reinterpret_cast<const uint8_t *>(buf), buf_pos - size_of_crc);
            if ((char(int2hex[((crc>>12)&0xF)]) != buf[buf_pos-4])||
                (char(int2hex[((crc>> 8)&0xF)]) != buf[buf_pos-3])||
                (char(int2hex[((crc>> 4)&0xF)]) != buf[buf_pos-2])||
                (char(int2hex[((crc>> 0)&0xF)]) != buf[buf_pos-1])) {
                send_bad_crc_response();
                buf_pos = 0;
                break;
            }

            // Command valid, execute
            switch(buf[0]) {

                // Set X/Z feed rate
                case 'X':
                case 'Z': {
                            if (buf_pos < (1 + 16 + size_of_crc)) {
                                send_invalid_response();
                            } else {
                                uint32_t mul = 0;
                                uint32_t div = 0;
                                sscanf(&buf[1],"%08x%08x", (unsigned int *)&mul, (unsigned int *)&div);
                                if (div <= 0) {
                                    send_invalid_response();
                                    break;
                                }
                                set_follow_values(buf[0] == 'Z' ? 0 : 1, int32_t(mul), int32_t(div));
                                send_ok_response();
                            }
                        } break;

                // Follow mode
                case 'F': {
                            if (buf_pos < (1 + 1) || (buf[1] != 'Z' && buf[1] != 'X'  && buf[1] != 'B')) {
                                send_invalid_response();
                            } else {
                                switch(buf[1]) {
                                    case    'Z': {
                                                set_current_run_mode(run_mode_follow_z);
                                            } break;
                                    case    'X': {
                                                set_current_run_mode(run_mode_follow_x);
                                            } break;
                                    case    'B': {
                                                set_current_run_mode(run_mode_follow_zx);
                                            } break;
                                }
                                send_ok_response();
                            }
                        } break;

                // Halt and Idle!
                case 'H': {
                            if (buf_pos < (1 + 1) || (buf[1] != '1' && buf[1] != '0')) {
                                send_invalid_response();
                            } else {
                                set_current_run_mode(buf[1] == '1' ? run_mode_idle : run_mode_none);
                                send_ok_response();
                            }
                        } break;
                        
                case 'J': {
                            if (buf_pos < (1 + 1 + 32) || (buf[1] != 'Z' && buf[1] != 'X')) {
                                send_invalid_response();
                            } else {
                            	if (buf[1] == 'Z') {
									set_current_run_mode(run_mode_jog_z);
                            	} else {
									set_current_run_mode(run_mode_jog_x);
                            	}
                            
								int32_t step = 0;
								int32_t accel = 0;
								int32_t decel = 0;
								int32_t speed = 0;

                                sscanf(&buf[2],"%08x%08x%08x%08x",  
                                	(unsigned int *)&step, 	
									(unsigned int *)&accel, 
									(unsigned int *)&decel, 
									(unsigned int *)&speed);

								uint32_t max_s_lim;
								uint32_t accel_lim;

								if(step < 0) {
									jog_state.dir = -1;
									step = -step;
								}
								else {
									jog_state.dir = +1;
								}

