tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
								#define T1_FREQ 1382400
								#define ALPHA (2*3.14159/3200)
								#define A_T_x100 ((int32_t)(ALPHA*T1_FREQ*100)) 
								#define T1_FREQ_148 ((int32_t)((T1_FREQ*0.676)/100))
								#define A_SQ (int32_t)(ALPHA*2*10000000000)
								#define A_x20000 (int32_t)(ALPHA*20000)

								jog_state.min_delay = A_T_x100 / speed;
								jog_state.step_delay = (T1_FREQ_148 * sqrt(A_SQ / accel))/100;
								max_s_lim = (int32_t)speed*speed/(int32_t)(((int32_t)A_x20000*accel)/100);
								if(max_s_lim == 0) {
									max_s_lim = 1;
								}
								accel_lim = ((int32_t)step*decel) / (accel+decel);
								if(accel_lim == 0) {
									accel_lim = 1;
								}
								if(accel_lim <= max_s_lim) {
									jog_state.decel_val = accel_lim - step;
								}
								else{
									jog_state.decel_val = -((int32_t)max_s_lim*accel)/decel;
								}
								if(jog_state.decel_val == 0) {
									jog_state.decel_val = -1;
								}
								jog_state.decel_start = step + jog_state.decel_val;
								if(jog_state.step_delay <= jog_state.min_delay){
									jog_state.step_delay = jog_state.min_delay;
									jog_state.run_state = RUN;
								}
								else {
									jog_state.run_state = ACCEL;
								}
								jog_state.accel_count = 0;

								TIM2->ARR = jog_state.step_delay;
								
                                send_ok_response();
							}
                		} break;
                        
                // Run cycle
                case 'C': {
                            // Set to none while we are parsing
                            set_current_run_mode(run_mode_none);

                            size_t pos = 1;
                            bool ok_to_run = true;
                            int32_t prev_target_pos = 0;

                            current_cycle_len = 0;
                            current_cycle_idx = 0;

                            for ( ; pos < (buf_pos - size_of_crc - 1) ; ) {

                                if ((buf_pos - size_of_crc - pos) < 49) {
                                    ok_to_run = false;
                                    break;
                                }
                                
                                if (buf[pos] != 'X' && buf[pos] != 'Z') {
                                    ok_to_run = false;
                                    break;
                                }

                                cycle_entry entry;
                                entry.target_axs = (buf[pos] == 'X') ? 1 : 0; pos++; // 1
								
                                uint32_t upper;
                                uint32_t lower;
								sscanf(&buf[pos],"%08x%08x",(unsigned int *)&upper, (unsigned int *)&lower); pos += 16;
                                entry.target_pos = (int64_t(upper) << 32) | int64_t(lower);
								sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_mul_z); pos += 8;
								sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_div_z); pos += 8;
								sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_mul_x); pos += 8;
								sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_div_x); pos += 8;
								sscanf(&buf[pos],"%08x",(unsigned int *)&entry.wait_for_index_zero); pos += 8;

                                entry.stepper_div_z_opt = libdivide::libdivide_s64_gen(entry.stepper_div_z);
                                entry.stepper_div_x_opt = libdivide::libdivide_s64_gen(entry.stepper_div_x);
                                
                                if (entry.stepper_div_z < 0 ||
                                    entry.stepper_div_x < 0) {
                                    ok_to_run = false;
                                    break;
                                }
                                
                                // verify
                                if (entry.target_axs == 0) {
                                    if (entry.stepper_mul_z > 0 && prev_target_pos > entry.target_pos) {
                                        ok_to_run = false;
                                        break;
                                    }
                                    if (entry.stepper_mul_z < 0 && prev_target_pos < entry.target_pos) {
                                        ok_to_run = false;
                                        break;
                                    }
                                } else {
                                    if (entry.stepper_mul_x > 0 && prev_target_pos > entry.target_pos) {
                                        ok_to_run = false;
                                        break;
                                    }
                                    if (entry.stepper_mul_x < 0 && prev_target_pos < entry.target_pos) {
                                        ok_to_run = false;
                                        break;
                                    }
                                }
                                prev_target_pos = entry.target_pos;
                                
                                current_cycle[current_cycle_idx++]= entry;

                                if (current_cycle_idx >= current_cycle_max) {
                                    break;
                                }
                            }
							
                            if (ok_to_run && current_cycle_idx > 0) {
								current_cycle_len = current_cycle_idx;
								current_cycle_idx = 0;
                                set_current_run_mode(run_mode_cycle);
                                send_ok_response();
                            } else {
								current_cycle_len = 0;
								current_cycle_idx = 0;
								send_invalid_response();
                            }
                        } break;

                // Pause cycle
                case 'P': {
                            if (buf_pos < (1 + 1) || (buf[1] != '1' && buf[1] != '0') || current_run_mode != run_mode_cycle) {
                                send_invalid_response();
                            } else {
                                set_current_run_mode(buf[1] == '1' ? run_mode_cycle_pause : run_mode_cycle);
                                send_ok_response();
                            }
                        } break;
                        
                // Reset to zero
                case 'R': {
                            set_zero_pos();
                            send_ok_response();
                        } break;

                // Get raw status
                case 'S': {
                            int16_t cnt = TIM3->CNT;

                            char sts[256];
                            size_t pos = 0;
                            snprintf(&sts[pos], 32, "%08lX%08lX", uint32_t(uint64_t(absolute_pos + cnt  )>>32),
                                                                  uint32_t(uint64_t(absolute_pos + cnt  ))); pos += 16; // 1
                            snprintf(&sts[pos], 32, "%08lX%08lX", uint32_t(uint64_t(stepper_actual_pos_z + stepper_off_z)>>32),
                                                                  uint32_t(uint64_t(stepper_actual_pos_z + stepper_off_z))); pos += 16; // 2
                            snprintf(&sts[pos], 32, "%08lX%08lX", uint32_t(uint64_t(stepper_actual_pos_x + stepper_off_x)>>32),
                                                                  uint32_t(uint64_t(stepper_actual_pos_x + stepper_off_x))); pos += 16; // 3
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(cnt)); pos += 8; // 4
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(absolute_idx)); pos += 8; // 5
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(current_index_delta)); pos += 8; // 6
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(absolute_pos_start_offset)); pos += 8; // 7
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_mul_z)); pos += 8; // 8
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_div_z)); pos += 8; // 9
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_mul_x)); pos += 8; // 10
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_div_x)); pos += 8; // 11
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(cycle_counter)); pos += 8; // 12
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(error_index_offset)); pos += 8; // 13
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(absolute_tick)); pos += 8; // 14

